## Papildoma manipuliacija ir filtravimas

In [ ]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.rand(5,6), 
                  ['a', 'b', 'c', 'd', 'e'], 
                  ['U', 'V', 'W', 'X', 'Y', 'Z'])
df

In [ ]:
filtered = df[df > .15]
filtered

In [ ]:
truthtable = filtered.isnull()
truthtable

In [ ]:
truthtable.sum()

In [ ]:
truthtable['X']

In [44]:
filtered.dropna()

         U         V         W         X         Y         Z
c  0.99976  0.333867  0.514434  0.244922  0.242771  0.823555

In [45]:
filtered.dropna(axis=1)

          U         Y         Z
a  0.861733  0.488417  0.970644
b  0.296447  0.736167  0.720620
c  0.999760  0.242771  0.823555
d  0.155708  0.176819  0.816909
e  0.625291  0.856170  0.744007

In [46]:
filtered.dropna(thresh=5)

          U         V         W         X         Y         Z
a  0.861733  0.564801  0.653437       NaN  0.488417  0.970644
b  0.296447       NaN  0.443841  0.311570  0.736167  0.720620
c  0.999760  0.333867  0.514434  0.244922  0.242771  0.823555
d  0.155708  0.667196  0.842115       NaN  0.176819  0.816909

In [47]:
filtered.dropna(thresh=3, axis=1)

          U         V         W         Y         Z
a  0.861733  0.564801  0.653437  0.488417  0.970644
b  0.296447       NaN  0.443841  0.736167  0.720620
c  0.999760  0.333867  0.514434  0.242771  0.823555
d  0.155708  0.667196  0.842115  0.176819  0.816909
e  0.625291       NaN       NaN  0.856170  0.744007

In [49]:
filtered.fillna(0)

          U         V         W         X         Y         Z
a  0.861733  0.564801  0.653437  0.000000  0.488417  0.970644
b  0.296447  0.000000  0.443841  0.311570  0.736167  0.720620
c  0.999760  0.333867  0.514434  0.244922  0.242771  0.823555
d  0.155708  0.667196  0.842115  0.000000  0.176819  0.816909
e  0.625291  0.000000  0.000000  0.000000  0.856170  0.744007

In [52]:
filtered.fillna(value=df['Y'].mean())

          U         V         W         X         Y         Z
a  0.861733  0.564801  0.653437  0.500069  0.488417  0.970644
b  0.296447  0.500069  0.443841  0.311570  0.736167  0.720620
c  0.999760  0.333867  0.514434  0.244922  0.242771  0.823555
d  0.155708  0.667196  0.842115  0.500069  0.176819  0.816909
e  0.625291  0.500069  0.500069  0.500069  0.856170  0.744007

## Grupavimas

In [58]:
duomenys = {'Šalis': ['Lietuva', 'Lietuva', 'Lietuva',
  'Latvija', 'Latvija', 'Latvija',
  'Estija', 'Estija', 'Estija'],
 'Miestas': ['Vilnius', 'Kaunas', 'Klaipėda',
  'Ryga', 'Ventspilis', 'Daugpilis',
  'Talinas', 'Tartu', 'Pernu'],
 'Gyv': [541, 287, 147, 716, 43, 105, 400, 101, 46]}
miestai = pd.DataFrame(duomenys)
miestai['Gyv'] *= 1000
miestai

     Šalis     Miestas     Gyv
0  Lietuva     Vilnius  541000
1  Lietuva      Kaunas  287000
2  Lietuva    Klaipėda  147000
3  Latvija        Ryga  716000
4  Latvija  Ventspilis   43000
5  Latvija   Daugpilis  105000
6   Estija     Talinas  400000
7   Estija       Tartu  101000
8   Estija       Pernu   46000

In [62]:
grupuoti = miestai.groupby('Šalis')
grupuoti.sum()

            Gyv
Šalis
Estija   547000
Latvija  864000
Lietuva  975000

In [63]:
grupuoti.count()

         Miestas  Gyv
Šalis
Estija         3    3
Latvija        3    3
Lietuva        3    3

In [64]:
grupuoti.max()

            Miestas     Gyv
Šalis
Estija        Tartu  400000
Latvija  Ventspilis  716000
Lietuva     Vilnius  541000

In [65]:
grupuoti.min()

           Miestas     Gyv
Šalis
Estija       Pernu   46000
Latvija  Daugpilis   43000
Lietuva     Kaunas  147000

In [71]:
grupuoti.sum().loc['Lietuva']

Gyv    975000
Name: Lietuva, dtype: int64

In [72]:
grupuoti.describe()

          Gyv                                                              \
        count           mean            std       min       25%       50%
Šalis
Estija    3.0  182333.333333  190500.218723   46000.0   73500.0  101000.0
Latvija   3.0  288000.000000  371952.954014   43000.0   74000.0  105000.0
Lietuva   3.0  325000.000000  199729.817504  147000.0  217000.0  287000.0


              75%       max
Šalis
Estija   250500.0  400000.0
Latvija  410500.0  716000.0
Lietuva  414000.0  541000.0

In [73]:
grupuoti.describe().transpose()

Šalis             Estija        Latvija        Lietuva
Gyv count       3.000000       3.000000       3.000000
    mean   182333.333333  288000.000000  325000.000000
    std    190500.218723  371952.954014  199729.817504
    min     46000.000000   43000.000000  147000.000000
    25%     73500.000000   74000.000000  217000.000000
    50%    101000.000000  105000.000000  287000.000000
    75%    250500.000000  410500.000000  414000.000000
    max    400000.000000  716000.000000  541000.000000

In [74]:
grupuoti.describe().transpose()['Estija']

Gyv  count         3.000000
     mean     182333.333333
     std      190500.218723
     min       46000.000000
     25%       73500.000000
     50%      101000.000000
     75%      250500.000000
     max      400000.000000
Name: Estija, dtype: float64

## DF Jungimas

In [85]:
dalis_miestu = miestai[:6]
dalis_miestu

     Šalis     Miestas     Gyv
0  Lietuva     Vilnius  541000
1  Lietuva      Kaunas  287000
2  Lietuva    Klaipėda  147000
3  Latvija        Ryga  716000
4  Latvija  Ventspilis   43000
5  Latvija   Daugpilis  105000

In [77]:
kiti_miestai = miestai[6:]
kiti_miestai

    Šalis  Miestas     Gyv
6  Estija  Talinas  400000
7  Estija    Tartu  101000
8  Estija    Pernu   46000

In [79]:
visi_miestai = pd.concat([dalis_miestu, kiti_miestai])
visi_miestai

     Šalis     Miestas     Gyv
0  Lietuva     Vilnius  541000
1  Lietuva      Kaunas  287000
2  Lietuva    Klaipėda  147000
3  Latvija        Ryga  716000
4  Latvija  Ventspilis   43000
5  Latvija   Daugpilis  105000
6   Estija     Talinas  400000
7   Estija       Tartu  101000
8   Estija       Pernu   46000

In [80]:
pagerinti_miestai = pd.concat([dalis_miestu, kiti_miestai], axis=1)
pagerinti_miestai

     Šalis     Miestas       Gyv   Šalis  Miestas       Gyv
0  Lietuva     Vilnius  541000.0     NaN      NaN       NaN
1  Lietuva      Kaunas  287000.0     NaN      NaN       NaN
2  Lietuva    Klaipėda  147000.0     NaN      NaN       NaN
3  Latvija        Ryga  716000.0     NaN      NaN       NaN
4  Latvija  Ventspilis   43000.0     NaN      NaN       NaN
5  Latvija   Daugpilis  105000.0     NaN      NaN       NaN
6      NaN         NaN       NaN  Estija  Talinas  400000.0
7      NaN         NaN       NaN  Estija    Tartu  101000.0
8      NaN         NaN       NaN  Estija    Pernu   46000.0

In [111]:
desinieji = kiti_miestai.reset_index()
desinieji.drop(columns='index', inplace=True)
desinieji

    Šalis  Miestas     Gyv
0  Estija  Talinas  400000
1  Estija    Tartu  101000
2  Estija    Pernu   46000

In [112]:
lenkija = {'Šalis': ['Lenkija', 'Lenkija', 'Lenkija'], 
           'Miestas':['Varšuva', 'Vroclavas', 'Gdanskas'], 
          'Gyv': [1688000, 638000, 461000]}
pl = pd.DataFrame(lenkija)
desinieji1 = pd.concat([desinieji, pl])
desinieji = desinieji1.reset_index().drop(columns='index')
desinieji

     Šalis    Miestas      Gyv
0   Estija    Talinas   400000
1   Estija      Tartu   101000
2   Estija      Pernu    46000
3  Lenkija    Varšuva  1688000
4  Lenkija  Vroclavas   638000
5  Lenkija   Gdanskas   461000

In [113]:
pagrindiniai_miestai = pd.concat([dalis_miestu, desinieji], axis=1)
pagrindiniai_miestai

     Šalis     Miestas     Gyv key key2    Šalis    Miestas      Gyv
0  Lietuva     Vilnius  541000   A    B   Estija    Talinas   400000
1  Lietuva      Kaunas  287000   B    C   Estija      Tartu   101000
2  Lietuva    Klaipėda  147000   C    D   Estija      Pernu    46000
3  Latvija        Ryga  716000   D    E  Lenkija    Varšuva  1688000
4  Latvija  Ventspilis   43000   E    F  Lenkija  Vroclavas   638000
5  Latvija   Daugpilis  105000   F    G  Lenkija   Gdanskas   461000

In [114]:
key = 'A B C D E F'.split()
dalis_miestu['key'] = key
desinieji['key'] = key
dalis_miestu

C:\Users\infoh\AppData\Local\Temp\ipykernel_23220\1429993042.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dalis_miestu['key'] = key

     Šalis     Miestas     Gyv key key2
0  Lietuva     Vilnius  541000   A    B
1  Lietuva      Kaunas  287000   B    C
2  Lietuva    Klaipėda  147000   C    D
3  Latvija        Ryga  716000   D    E
4  Latvija  Ventspilis   43000   E    F
5  Latvija   Daugpilis  105000   F    G

In [115]:
desinieji

     Šalis    Miestas      Gyv key
0   Estija    Talinas   400000   A
1   Estija      Tartu   101000   B
2   Estija      Pernu    46000   C
3  Lenkija    Varšuva  1688000   D
4  Lenkija  Vroclavas   638000   E
5  Lenkija   Gdanskas   461000   F

In [116]:
pd.merge(dalis_miestu, desinieji, on='key')

   Šalis_x   Miestas_x   Gyv_x key key2  Šalis_y  Miestas_y    Gyv_y
0  Lietuva     Vilnius  541000   A    B   Estija    Talinas   400000
1  Lietuva      Kaunas  287000   B    C   Estija      Tartu   101000
2  Lietuva    Klaipėda  147000   C    D   Estija      Pernu    46000
3  Latvija        Ryga  716000   D    E  Lenkija    Varšuva  1688000
4  Latvija  Ventspilis   43000   E    F  Lenkija  Vroclavas   638000
5  Latvija   Daugpilis  105000   F    G  Lenkija   Gdanskas   461000

In [117]:
key2 = 'B C D E F G'.split()
dalis_miestu['key2'] = key2
desinieji['key2'] = key2
dalis_miestu

C:\Users\infoh\AppData\Local\Temp\ipykernel_23220\2490857048.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dalis_miestu['key2'] = key2

     Šalis     Miestas     Gyv key key2
0  Lietuva     Vilnius  541000   A    B
1  Lietuva      Kaunas  287000   B    C
2  Lietuva    Klaipėda  147000   C    D
3  Latvija        Ryga  716000   D    E
4  Latvija  Ventspilis   43000   E    F
5  Latvija   Daugpilis  105000   F    G

In [118]:
desinieji

     Šalis    Miestas      Gyv key key2
0   Estija    Talinas   400000   A    B
1   Estija      Tartu   101000   B    C
2   Estija      Pernu    46000   C    D
3  Lenkija    Varšuva  1688000   D    E
4  Lenkija  Vroclavas   638000   E    F
5  Lenkija   Gdanskas   461000   F    G

In [121]:
pd.merge(dalis_miestu, desinieji, on=['key', 'key2'])

   Šalis_x   Miestas_x   Gyv_x key key2  Šalis_y  Miestas_y    Gyv_y
0  Lietuva      Kaunas  287000   B    C   Estija      Tartu   101000
1  Lietuva    Klaipėda  147000   C    D   Estija      Pernu    46000
2  Latvija        Ryga  716000   D    E  Lenkija    Varšuva  1688000
3  Latvija  Ventspilis   43000   E    F  Lenkija  Vroclavas   638000

In [120]:
keyX = 'W C D E F W'.split()
desinieji['key2'] = keyX
desinieji

     Šalis    Miestas      Gyv key key2
0   Estija    Talinas   400000   A    W
1   Estija      Tartu   101000   B    C
2   Estija      Pernu    46000   C    D
3  Lenkija    Varšuva  1688000   D    E
4  Lenkija  Vroclavas   638000   E    F
5  Lenkija   Gdanskas   461000   F    W

In [122]:
dalis_miestu.join(desinieji, lsuffix='_kairieji', rsuffix='_desinieji')

,Šalis_kairieji,Miestas_kairieji,Gyv_kairieji,key_kairieji,key2_kairieji,Šalis_desinieji,Miestas_desinieji,Gyv_desinieji,key_desinieji,key2_desinieji
0,Lietuva,Vilnius,541000,A,B,Estija,Talinas,400000,A,W
1,Lietuva,Kaunas,287000,B,C,Estija,Tartu,101000,B,C
2,Lietuva,Klaipėda,147000,C,D,Estija,Pernu,46000,C,D
3,Latvija,Ryga,716000,D,E,Lenkija,Varšuva,1688000,D,E
4,Latvija,Ventspilis,43000,E,F,Lenkija,Vroclavas,638000,E,F
5,Latvija,Daugpilis,105000,F,G,Lenkija,Gdanskas,461000,F,W